package Seminar_05;

public class Example {
    public static void main(String[] args) {
        /*
        Создать структуру для хранения Номеров паспортов и Фамилий сотрудников организации.
        123456 Иванов
        321456 Васильев
        234561 Петрова
        234432 Иванов
        654321 Петрова
        345678 Иванов
        Вывести данные по сотрудникам с фамилией Иванов.

        Даны 2 строки, написать метод, который вернет true, если эти строки являются изоморфными
        и false, если нет. Строки изоморфны, если одну букву в первом слове можно заменить
        на некоторую букву во втором слове, при этом повторяющиеся буквы одного слова меняются на 
        одну и ту же букву с сохранением порядка следования. 
        (Например, add - egg изоморфны) буква может не меняться, а остаться такой же. 
        (Например, note - code)
        Пример 1:
        Input: s = "foo", t = "bar"
        Output: false
        Пример 2:
        Input: s = "paper", t = "title"
        Output: true

        Написать программу, определяющую правильность расстановки скобок в выражении.
        Пример 1: a+(d*3) - истина
        Пример 2: [a+(1*3) - ложь
        Пример 3: [6+(3*3)] - истина
        Пример 4: {a}[+]{(d*3)} - истина
        Пример 5: <{a}+{(d*3)}> - истина
        Пример 6: {a+]}{(d*3)} - ложь

        Взять набор строк, например,

        Мороз и солнце день чудесный
        Еще ты дремлешь друг прелестный
        Пора красавица проснись.

        Написать метод, который отсортирует эти строки по длине слова с помощью TreeMap. 
        Строки с одинаковой длиной не должны “потеряться”.
         */
    }
}
