

public class Seminar_02 {
    public static void main(String[] args) {
        /*
        Дано четное число N (>0) и символы c1 и c2. 
        Написать метод, который вернет строку длины N, которая состоит из 
        чередующихся символов c1 и c2, начиная с c1.
        Ответ: c1c2c1…c2 (всего N символов)

        Напишите метод, который сжимает строку. 
        Пример: вход aaaabbbcdd.
        Результат: a4b3cd2

        Напишите метод, который принимает на вход строку (String) и определяет является 
        ли строка палиндромом (возвращает boolean значение).
        Полиндром - Слово или фраза, которые одинаково читаются слева направо и справа налево.

        Напишите метод, который составит строку, состоящую из 100 повторений слова TEST и метод, 
        который запишет эту строку в простой текстовый файл, обработайте исключения.
         */
        
    }
}
